apim-migration-testing-tool-rest-assured/src/test/payloads/checkDomainAvailabilityRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ser="http://services.mgt.tenant.carbon.wso2.org">
   <soap:Header/>
   <soap:Body>
      <ser:checkDomainAvailability>
         <!--Optional:-->
         <ser:domainName>test1_tenant.com</ser:domainName>
      </ser:checkDomainAvailability>
   </soap:Body>
</soap:Envelope>